shortcuts.tex
% Created 2013-04-05 Fri 10:42
\documentclass[english]{rcalibrionecolumn}


\providecommand{\alert}[1]{\textbf{#1}}

\title{\color{statblue}{Emacs Shortcuts}}
\author{\color{statblue}Ronert Obst}
\date{\color{statblue}\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}
\section{Help}
\label{sec-1}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}  &  \textbf{Shortcut}  \\
\hline
 help-command     &  <f1>               \\
 apropos          &  <f1>-a             \\
 describe-mode    &  <f1>-m             \\
\end{tabular}
\end{center}
\section{Buffers, Windows, Frames and Files}
\label{sec-2}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}                    &  \textbf{Shortcut}  \\
\hline
 find-name-dired                    &  C-c s              \\
 dired-jump                         &  C-x C-j            \\
 find recent file                   &  C-x f              \\
 rename-current-buffer-file         &  C-x w              \\
 delete-current-buffer-file         &  C-x C-k            \\
 In ido-find-file go to home        &  C-c h              \\
\hline
 ibuffer                            &  C-x C-b            \\
\hline
 rotate-windows                     &  C-x -              \\
 find-file-other-window             &  C-x M-f            \\
\hline
 create new frame                   &  C-x C-n            \\
\hline
 winner-undo                        &  C-c <up>           \\
 winner-redo                        &  C-c <down>         \\
\hline
 split-window-horizontally-instead  &  C-x vertical line  \\
 split-window-vertically-instead    &  C-x underscore     \\
\hline
 window-jump-down                   &  C-2                \\
 window-jump-up                     &  C-8                \\
 window-jump-left                   &  C-4                \\
 window-jump-right                  &  C-6                \\
\hline
 switch-space                       &  C-5                \\
 new-space                          &  C-7                \\
 save-space                         &  C-9                \\
 kill-space                         &  C-1                \\
\end{tabular}
\end{center}
\section{Navigation}
\label{sec-3}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}                  &  \textbf{Shortcut}  \\
\hline
 ace-jump-line-mode               &  jj                 \\
 ace-jump-word-mode               &  hh                 \\
 jump-char-forward                &  kk                 \\
 jump-char-backward               &  aa                 \\
 iy-go-to-char                    &  öö                 \\
 beginning-of-defun               &  C-M-a              \\
 end-of-defun                     &  C-M-e              \\
\hline
 ergoemacs-forward-block          &  S-<down>           \\
 ergoemacs-backward-block         &  S-<up>             \\
 ergoemacs-backward-open-bracket  &  S-<left>           \\
 ergoemacs-forward-close-bracket  &  S-<right>          \\
\hline
 es-move-text-right               &  C-S-<right>        \\
 es-move-text-left                &  C-S-<left>         \\
 es-move-text-up                  &  C-S-<up>           \\
 es-move-text-down                &  C-S-<down>         \\
\hline
 move up 5 lines                  &  C-S-p              \\
 move down 5 lines                &  C-S-n              \\
 move right 5 characters          &  C-S-f              \\
 move left 5 characters           &  C-S-b              \\
\end{tabular}
\end{center}
\section{Bookmarks}
\label{sec-4}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}  &  \textbf{Shortcut}  \\
\hline
 bookmark-set     &  F13                \\
 bookmark-list    &  F14                \\
 bookmark-jump    &  F15                \\
\end{tabular}
\end{center}
\section{Search}
\label{sec-5}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}                &  \textbf{Shortcut}  \\
\hline
 multi-occur-in-this-mode       &  C-c r              \\
 rgrep                          &  C-x C-r            \\
 prelude-ido-goto-symbol        &  C-c i              \\
\hline
 ack-and-a-half                 &  C-c 1              \\
 ack-and-a-half-same            &  C-c 2              \\
 ack-and-a-half-find-file       &  C-c 3              \\
 ack-and-a-half-find-file-same  &  C-c 4              \\
\hline
 ag-regexp                      &  C-c 5              \\
 ag-project                     &  C-c 6              \\
 ag-project-at-point            &  C-c 7              \\
 ag-regexp-project-at-point     &  C-c 8              \\
\hline
\end{tabular}
\end{center}
\section{Projectile}
\label{sec-6}


\begin{center}
\begin{tabular}{ll}
 \textbf{Actions}                                    &  \textbf{Shortcut}  \\
\hline
 Display a list of all files in the project          &  C-c p f            \\
 Display a list of all test files                    &  C-c p T            \\
 Run grep on the files in the project                &  C-c p g            \\
 Display a list of all open project buffers          &  C-c p b            \\
 Runs `multi-occur` on all open project buffers      &  C-c p o            \\
 Runs interactive query-replace  files in  projects  &  C-c p r            \\
 Invalidates the project cache (if existing)         &  C-c p i            \\
 Regenerates the projects `TAGS` file                &  C-c p R            \\
 Kills all project buffers                           &  C-c p k            \\
 Opens the root of the project in `dired`            &  C-c p d            \\
 Shows a list of recently visited project files      &  C-c p e            \\
 Runs `ack` on the project                           &  C-c p a            \\
 Runs a standard compilation command                 &  C-c p l            \\
 Runs a standard test command                        &  C-c p p            \\
 Adds the currently visited to the cache             &  C-c p z            \\
 Display a list of known projects you can switch to  &  C-c p s            \\
\end{tabular}
\end{center}
\section{Helm}
\label{sec-7}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}  &  \textbf{Shortcut}  \\
\hline
 helm-mini        &  C-c h              \\
 helm-descbinds   &  C-c C-h            \\
 helm-projectile  &  C-c p h            \\
\end{tabular}
\end{center}
