shortcuts.org
* Version Control
#+ATTR_LaTeX: longtable
| *Action*                                  | *Shortcut*    |
|-------------------------------------------+---------------|
| magit-init                                | F17           |
| magit-status                              | C-x g or F16  |
| refresh status                            | g             |
| *Sections*                                |               |
|-------------------------------------------+---------------|
| toggle visibility of current section      | TAB           |
| toggle visib. of selec. and children      | S-TAB         |
| expand current sec. to detail level       | 1, 2, 3 and 4 |
| expand all sec. to detail level           | M-1, 2, 3, 4  |
|-------------------------------------------+---------------|
| *Untracked Files*                         |               |
| stage                                     | s             |
| ignore file                               | i             |
| prompt for file to ignore                 | C-u i         |
|-------------------------------------------+---------------|
| *Staging and Commiting*                   |               |
| stage current hunk                        | s             |
| unstage current hunk                      | u             |
| stage all hunks                           | S             |
| unstage all hunks                         | U             |
| discard uncomitted changes                | k             |
| prepare for commit                        | c             |
| execute commit                            | C-c C-c       |
|-------------------------------------------+---------------|
| *History*                                 |               |
| history                                   | l             |
| verbose history                           | L             |
| inspect commit                            | RET           |
| copy sha1 of current commit to kill ring  | C-w           |
| show diff between current and marked com. |               |
| mark current commit                       | ..            |
| unmark current commit if marked           | .             |
| magit toggle whitespace                   | W             |
| grep history                              | s             |
|-------------------------------------------+---------------|
| *Diff*                                    |               |
| shwo changes working tree and head        | d             |
| show changes two arbitrary revisions      | D             |
| apply current changes to working tree     | a             |
|-------------------------------------------+---------------|
| *Resetting*                               |               |
| reset current head to chosen revision     | x             |
| reset working tree and staging area       | X             |
|-------------------------------------------+---------------|
| *Branching*                               |               |
| switch to different branch                | b             |
| create and switch to new branch           | B             |
|-------------------------------------------+---------------|
| *Pushing and Pulling*                     |               |
| git push                                  | P             |
| git push to specified remote repository   | C-u P         |
| git remote update                         | f             |
| git pull                                  | F             |
|-------------------------------------------+---------------|
| toggle git-gutter                         | F18           |
| popup-diff git-gutter                     | F19           |
| vc-annotate                               | C-x v g       |
* Text Manipulation
| *Action*                    | *Shortcut*        |
|-----------------------------+-------------------|
| hippie-expand               | C-. or ..         |
| auto-complete               | C-, or ,,         |
| yas-expand                  | C- -              |
|-----------------------------+-------------------|
| browse-kill-ring            | C-x y             |
| undo-tree-visualize         | C-c v             |
| query-replace-regexp        | M-&               |
| cleanup-buffer              | C-c ß             |
| prelude-cleanup-buffer      | M-ß               |
| align-regexp                | C-x //            |
| linum-mode                  | C-<f6>            |
|-----------------------------+-------------------|
| open-line-below             | uu                |
| open-line-above             | ii                |
| duplicate-line              | C-c n             |
| join-line                   | C-x a             |
| move-line-up                | M-S-up            |
| move-line-down              | M-S-down          |
|-----------------------------+-------------------|
| zap-to-char                 | üü                |
| zap-up-to-char              | ää                |
| kill-lines                  | C-c C-<backspace> |
| kill-whole-line             | C-S-<backspace>   |
| kill-back-to-indentation    | C-M-<backspace>   |
| kill-line-backwards         | C-<backspace>     |
|-----------------------------+-------------------|
| comment-or-uncomment-region | C-c c             |
| uncomment-region            | C-c u             |
|-----------------------------+-------------------|
| mark-whole-buffer           | C-c m             |
| mark-defun                  | C-M-h             |
| mc/mark-all-like-this       | C-ä               |
| mc/mark-previous-like-this  | C-ü               |
| mc/mark-next-like-this      | C-ö               |
| expand-region               | - -               |
| move with expand region     | s-<arrow>         |
* Macros
| *Action*                   | *Shortcut*          |
|--------------------------+-------------------|
| defining-kbd-macro       | <f3>              |
| kmacro-end-or-call-macro | <f4>              |
* Terminal
| *Action*   | *Shortcut* |
|------------+------------|
| eshell     | C-t        |
| new eshell | C-x M      |
