shortcuts.tex
\section{Dired}
\label{sec-8}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}  &  \textbf{Shortcut}  \\
\hline
 wdired           &  F12                \\
\end{tabular}
\end{center}
\section{Version Control}
\label{sec-9}

\begin{longtable}{ll}

 \textbf{Action}                            &  \textbf{Shortcut} \\
\hline
\endhead
\hline\multicolumn{2}{r}{Continued on next page}\
\endfoot
\endlastfoot
 magit-init                                 &  F17                \\
 magit-status                               &  C-x g or F16       \\
 refresh status                             &  g                  \\
 \textbf{Sections}                          &                     \\
\hline
 toggle visibility of current section       &  TAB                \\
 toggle visib. of selec. and children       &  S-TAB              \\
 expand current sec. to detail level        &  1, 2, 3 and 4      \\
 expand all sec. to detail level            &  M-1, 2, 3, 4       \\
\hline
 \textbf{Untracked Files}                   &                     \\
 stage                                      &  s                  \\
 ignore file                                &  i                  \\
 prompt for file to ignore                  &  C-u i              \\
\hline
 \textbf{Staging and Commiting}             &                     \\
 stage current hunk                         &  s                  \\
 unstage current hunk                       &  u                  \\
 stage all hunks                            &  S                  \\
 unstage all hunks                          &  U                  \\
 discard uncomitted changes                 &  k                  \\
 prepare for commit                         &  c                  \\
 execute commit                             &  C-c C-c            \\
\hline
 \textbf{History}                           &                     \\
 history                                    &  l                  \\
 verbose history                            &  L                  \\
 inspect commit                             &  RET                \\
 copy sha1 of current commit to kill ring   &  C-w                \\
 show diff between current and marked com.  &                     \\
 mark current commit                        &  ..                 \\
 unmark current commit if marked            &  .                  \\
 magit toggle whitespace                    &  W                  \\
 grep history                               &  s                  \\
\hline
 \textbf{Diff}                              &                     \\
 shwo changes working tree and head         &  d                  \\
 show changes two arbitrary revisions       &  D                  \\
 apply current changes to working tree      &  a                  \\
\hline
 \textbf{Resetting}                         &                     \\
 reset current head to chosen revision      &  x                  \\
 reset working tree and staging area        &  X                  \\
\hline
 \textbf{Branching}                         &                     \\
 switch to different branch                 &  b                  \\
 create and switch to new branch            &  B                  \\
\hline
 \textbf{Pushing and Pulling}               &                     \\
 git push                                   &  P                  \\
 git push to specified remote repository    &  C-u P              \\
 git remote update                          &  f                  \\
 git pull                                   &  F                  \\
\hline
 toggle git-gutter                          &  F18                \\
 popup-diff git-gutter                      &  F19                \\
 vc-annotate                                &  C-x v g            \\
\end{longtable}
\section{Text Manipulation}
\label{sec-10}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}              &  \textbf{Shortcut}  \\
\hline
 hippie-expand                &  C-. or ..          \\
 auto-complete                &  C-, or ,,          \\
 yas-expand                   &  C- -               \\
\hline
 browse-kill-ring             &  C-x y              \\
 undo-tree-visualize          &  C-c v              \\
 query-replace-regexp         &  M-\&               \\
 cleanup-buffer               &  C-c ß              \\
 prelude-cleanup-buffer       &  M-ß                \\
 align-regexp                 &  C-x //             \\
 linum-mode                   &  C-<f6>             \\
\hline
 open-line-below              &  ii                 \\
 open-line-above              &  uu                 \\
 duplicate-line               &  C-c n              \\
 join-line                    &  C-x a              \\
 move-line-up                 &  M-S-up             \\
 move-line-down               &  M-S-down           \\
 kill-lines                   &  C-c C-<backspace>  \\
\hline
 zap-to-char                  &  üü                 \\
 zap-up-to-char               &  ää                 \\
 kill-back-to-indentation     &  C-M-<backspace>    \\
\hline
 comment-or-uncomment-region  &  C-c c              \\
 uncomment-region             &  C-c u              \\
\hline
 mark-whole-buffer            &  C-c m              \\
 mark-defun                   &  C-M-h              \\
 mc/mark-all-like-this        &  C-ä                \\
 mc/mark-previous-like-this   &  C-ü                \\
 mc/mark-next-like-this       &  C-ö                \\
 expand-region                &  - -                \\
 move with expand region      &  s-<arrow>          \\
\end{tabular}
\end{center}
\section{Macros}
\label{sec-11}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}           &  \textbf{Shortcut}  \\
\hline
 defining-kbd-macro        &  <f3>               \\
 kmacro-end-or-call-macro  &  <f4>               \\
\end{tabular}
\end{center}
