shortcuts.tex
\section{Terminal}
\label{sec-12}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}  &  \textbf{Shortcut}  \\
\hline
 eshell           &  C-t                \\
 new eshell       &  C-x M              \\
\end{tabular}
\end{center}
\section{Org}
\label{sec-13}

\begin{longtable}{ll}

 \textbf{Action}                               &  \textbf{Shortcut}    \\
\hline
\endhead
\hline\multicolumn{2}{r}{Continued on next page}\
\endfoot
\endlastfoot
 \textbf{Headings}                             &                        \\
 rotate entire buffer visbiliy                 &  S-TAB                 \\
 next/previous heading                         &  C-c C-n/p             \\
 next/previous heading, same level             &  C-c C-f/b             \\
 backward to higher level heading              &  C-c C-u               \\
 jump to another place in document             &  C-c C-j               \\
 previous/next plain list item                 &  S-up/down             \\
 insert new heading/item at current level      &  M-RET                 \\
 insert new heading after subtree              &  C-RET                 \\
 insert new TODO entry/checkbox item           &  M-S-RET               \\
 insert TODO entry/ckbx after subtree          &  C-S-RET               \\
 turn (head)line into item, cycle item type    &  C-c -                 \\
 turn item/line into headline                  &  C-c *                 \\
 promote/demote heading                        &  M-left/right          \\
 promote/demote current subtree                &  M-s-left/right        \\
 move subtree/list item up/down                &  M-s-up/down           \\
 clone a subtree                               &  C-c C-x c             \\
 copy visible text                             &  C-c C-x v             \\
 kill/copy subtree                             &  C-c C-x C-w/M-w       \\
 yank subtree                                  &  C-c C-x C-y or C-y    \\
 narrow buffer to subtree / widen              &  C-x n s/w             \\
\hline
 \textbf{Tables}                               &                        \\
 convert region to table                       &  C-c vertical line     \\
 org-table-insert-line                         &  C-c -                 \\
 re-align the table without moving the cursor  &  C-c C-c               \\
 re-align the table, move to next field        &  TAB                   \\
 move to previous field                        &  S-TAB                 \\
 re-align the table, move to next row          &  RET                   \\
 move to beginning/end of field                &  M-a/e                 \\
 move the current column left                  &  M-left/right          \\
 kill the current column                       &  M-S-left              \\
 insert new column to left of cursor position  &  M-S-right             \\
 move the current row up/down                  &  M-up/down             \\
 kill the current row or horizontal line       &  M-S-up                \\
 insert new row above the current row          &  M-S-down              \\
 insert hline below (C-u : above) current row  &  C-c -                 \\
 insert hline and move to line below it        &  C-c RET               \\
 export as tab-separated file                  &  M-x org-table-export  \\
 import tab-separated file                     &  M-x org-table-import  \\
 sum numbers in current column/rectangle       &  C-c +                 \\
\hline
 \textbf{Links, Footnotes and Images}          &                        \\
 org-mac-link-grabber                          &  C-c g                 \\
 org-insert-link                               &  C-c C-l               \\
 insert a link (TAB completes stored links)    &  C-c C-l               \\
 insert file link with file name completion    &  C-u C-c C-l           \\
 edit (also hidden part of) link at point      &  C-c C-l               \\
 open file links in emacs                      &  C-c C-o               \\
 \ldots{}force open in emacs/other window      &  C-u C-c C-o           \\
 find next link                                &  C-c C-x C-n           \\
 find previous link                            &  C-c C-x C-p           \\
 toggle inline display of linked images        &  C-c C-x C-v           \\
 org-footnote-action                           &  C-c C-x f             \\
\hline
 \textbf{Code and \LaTeX{}}                    &                        \\
 org-edit-src-code                             &  C-c ü                 \\
 org-edit-src-exit                             &  C-c ä                 \\
 org-pretty-entities                           &  C-c C-x \\            \\
 insert template of export options             &  C-c C-e t             \\
 org-cdlatex-mode                              &  C-c ö                 \\
 preview \LaTeX{} fragment                     &  C-c C-x C-l           \\
 expand abbreviation (cdlatex-mode)            &  TAB                   \\
 insert/modify math symbol (cdlatex-mode)      &  ` / `                 \\
 execute code block at point                   &  C-c C-c               \\
 open results of code block at point           &  C-c C-o               \\
 check code block at point for errors          &  C-c C-v c             \\
 insert a header argument with completion      &  C-c C-v j             \\
 view expanded body of code block at point     &  C-c C-v v             \\
 view information about code block at point    &  C-c C-v I             \\
 go to named code block                        &  C-c C-v g             \\
 go to named result                            &  C-c C-v r             \\
 go to the head of the current code block      &  C-c C-v u             \\
 go to the next code block                     &  C-c C-v n             \\
 go to the previous code block                 &  C-c C-v p             \\
 execute all code blocks in current buffer     &  C-c C-v b             \\
 execute all code blocks in current subtree    &  C-c C-v s             \\
 tangle code blocks in current file            &  C-c C-v t             \\
\hline
 \textbf{Items and Checkboxes}                 &                        \\
 rotate the state of the current item          &  C-c C-t               \\
 select next/previous state                    &  S-left/right          \\
 select next/previous set                      &  C-S-left/right        \\
 toggle ORDERED property                       &  C-c C-x o             \\
 insert new checkbox item in plain list        &  M-S-RET               \\
 toggle checkbox at point                      &  C-c C-c               \\
\end{longtable}
\section{\LaTeX}
\label{sec-14}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}              &  \textbf{Shortcut}  \\
\hline
 \LaTeX{}-math-abbrev-prefix  &  C-c m              \\
 \TeX{}-texify                &  C-c C-a            \\
\end{tabular}
\end{center}
\section{Ref\TeX}
\label{sec-15}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}  &  \textbf{Shortcut}  \\
\hline
 citation         &  C-c (              \\
 reference        &  C-c )              \\
 label            &  C-c l              \\
\end{tabular}
\end{center}
\section{Writing}
\label{sec-16}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}  &  \textbf{Shortcut}  \\
\hline
 writegood-mode   &  C-c w              \\
\end{tabular}
\end{center}
\section{ESS}
\label{sec-17}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}      &  \textbf{Shortcut}  \\
\hline
 ess-tracebug-prefix  &  M-p                \\
 ess-bp-set           &  F5                 \\
 ess-bp-kill          &  F6                 \\
\end{tabular}
\end{center}
\section{Python}
\label{sec-18}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}  &  \textbf{Shortcut}  \\
\hline
\end{tabular}
\end{center}
\section{Haskell}
\label{sec-19}


\begin{center}
\begin{tabular}{ll}
 \textbf{Action}       &  \textbf{Shortcut}  \\
\hline
 load file in ghci     &  C-c C-l            \\
 \textbf{Action}       &  \textbf{Shortcut}  \\
\hline
 inferior sbt session  &  C-c C-v s          \\
\end{tabular}
\end{center}

\end{document}
